test/inject/inject.udp.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<SOAP-ENV:Body>
<m:AddPortMapping xmlns:m="urn:schemas-upnp-org:service:WANIPConnection:1">
<NewPortMappingDescription>the description</NewPortMappingDescription>
<NewLeaseDuration>1</NewLeaseDuration>
<NewInternalClient>8.8.8.8</NewInternalClient>
<NewEnabled>1</NewEnabled>
<NewExternalPort>12345</NewExternalPort>
<NewRemoteHost></NewRemoteHost>
<NewProtocol>UDP</NewProtocol>
<NewInternalPort>53</NewInternalPort>
</m:AddPortMapping>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
